---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageId.InvalidRenderingStyle
enum: Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId.InvalidRenderingStyle

An error message. The conversion code was unable to process a render style. The created model will differ in visual appearance.